app/views/posts/_form.html.erb


        <% Category.order(:title).each do |cat| %>
            <label>
            <%= check_box_tag("post[category_ids][]", cat.id, cat.id.in?(@post.categories.collect(&:id))) %>
---
SELECT "categories".* FROM "categories" ORDER BY "categories"."title" ASC
SELECT "categories".* FROM "categories"