app/views/posts/index.html.erb

 <h2>Showing all posts</h2>
 <h4><%= pluralize(@posts.count, 'post') %> in all</h4>
---
SELECT "posts".* FROM "posts"
SELECT COUNT(post) FROM "posts"

        <%= markdown(post.content) %>
        <%= @post.attachments.each do |at| %>
---
SELECT "attachments".* FROM "attachments" WHERE "attachments"."post_id" = $1  [["post_id", 11]]