app/views/posts/show.html.erb

SELECT "attachments".* FROM "attachments" WHERE "attachments"."post_id" = $1  [["post_id", 14]]
---
            <%= markdown(@post.content)  %>
            <%= @post.attachments.each do |at| %>