app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Fri, 13 Jun 2014 21:48:52 UTC +00:00], ["updated_at", Fri, 13 Jun 2014 21:48:52 UTC +00:00]]
---
def create
  @category = Category.new(category_params)

  if @category.save