app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params) #init model with attributes
        @post.attachments.build(params[:attachments])
        respond_to do |format|
        if @post.save #save model to db by mapping fields to columns
---
INSERT INTO "attachments" ("created_at", "imageable_id", "imageable_type", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 24 Jun 2014 14:55:21 UTC +00:00], ["imageable_id", 18], ["imageable_type", "Post"], ["updated_at", Tue, 24 Jun 2014 14:55:21 UTC +00:00]]