app/controllers/posts_controller.rb

    def index
        @posts = Post.all
        @attachment = Attachment.all
---
SELECT "posts".* FROM "posts"
SELECT "attachments".* FROM "attachments" WHERE "attachments"."post_id" = $1  [["post_id", 11]]

    def create
        @post = Post.new(post_params) #init model with attributes


        respond_to do |format|
        if @post.save #save model to db by mapping fields to columns
---
INSERT INTO "posts" ("content", "created_at", "excerpt", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "khkjhkhkh"], ["created_at", Fri, 13 Jun 2014 21:33:44 UTC +00:00], ["excerpt", "khkhkjhkjh"], ["title", "khkjhkjh"], ["updated_at", Fri, 13 Jun 2014 21:33:44 UTC +00:00]]

    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "10"]]
UPDATE "posts" SET "citations" = $1, "updated_at" = $2 WHERE "posts"."id" = 10  [["citations", "http://www.lipsum.com/\r\nhttp://shure.com"], ["updated_at", Wed, 11 Jun 2014 14:55:42 UTC +00:00]]

    def destroy
        @post = Post.find(params[:id])
        #@post.attachments.pictures = nil
        @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]